/* No comment provided by engineer. */
"Account or password not recognized" = "Tiliä tai salasanaa ei tunnistettu";

/* No comment provided by engineer. */
"The entered user name and password do not permit login to the remote server. One or both may not be valid, or they may have been entered incorrectly." = "Syötetty käyttäjätunnus ja salasana eivät mahdollista kirjautumista sisään etäpalvelimelle. Toinen tai molemmat saattavat olla virheellisiä tai ne on syötetty väärin.";

/* Plug-in name in Services list */
"BSD Flat File and NIS" = "BSD Flat File ja NIS";

/* No comment provided by engineer. */
"Can\\U02BCt configure Directory Services" = "Hakemistopalveluja ei voida määritellä";

/* No comment provided by engineer. */
"Can\\U02BCt connect to server" = "Palvelimeen ei voida yhdistää";

/* No comment provided by engineer. */
"Cancel" = "Kumoa";

/* No comment provided by engineer. */
"Back" = "Takaisin";

/* little text in dialogs telling user caps lock is on (10 pts) */
"caps lock on" = "isojen kirjainten lukitus päällä";

/* No comment provided by engineer. */
"Delete directory domain?" = "Poistetaanko hakemistodomain?";

/* Window Title */
"Directory Access: %@" = "Hakemistopalvelut: %@";

/* No comment provided by engineer. */
"An unexpected error occurred" = "Tapahtui odottamaton virhe";

/* No comment provided by engineer. */
"Directory Services may not be installed on the remote server, they may be turned off, or the URL may have been entered incorrectly." = "Hakemistopalveluita ei ehkä ole asennettu etäpalvelimelle, ne saattavat olla pois päältä tai syötetty osoite saattaa olla virheellinen.";

/* No comment provided by engineer. */
"Do you want to save changes before locking?" = "Haluatko tallentaa muutokset ennen lukitusta?";

/* No comment provided by engineer. */
"Do you want to save changes before quitting?" = "Haluatko tallentaa muutokset ennen lopettamista?";

/* No comment provided by engineer. */
"Don\\U02BCt Save" = "Älä tallenna";

/* No comment provided by engineer. */
"Edit of Custom path" = "Muokatun polun muokkaus";

/* No comment provided by engineer. */
"Failed to allocate data buffer." = "Datapuskurin varaaminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to allocate data list." = "Dataluettelon varaaminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to build data list from strings." = "Dataluettelon rakentaminen merkkijonoista epäonnistui.";

/* No comment provided by engineer. */
"Failed to change custom search policy." = "Muokatun etsintäkäytännön muuttaminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to change search policy." = "Etsintäkäytännön muuttaminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to deallocate data buffer." = "Datapuskurin vapauttaminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to get directory node count." = "Hakemistosolmujen määrän hakeminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to open directory node." = "Hakemistosolmun avaaminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to retrieve directory domains." = "Hakemistodomainien hakeminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to retrieve plug-in list." = "Liitännäisluettelon hakeminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to retrieve record attribute entry." = "Tietueen attribuuttimerkinnän hakeminen epäonnistui.";

/* No comment provided by engineer. */
"Failed to retrieve record entry." = "Tietuemerkinnän hakeminen epäonnistui.";

/* Error converting */
"IPv4 address required." = "IPv4-osoite vaaditaan.";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Please confirm deletion." = "Vahvista poisto.";

/* No comment provided by engineer. */
"Plug-in configuration application %@ could not be opened." = "Liitännäisen määrittelyohjelmaa %@ ei voitu avata.";

/* No comment provided by engineer. */
"Plug-in configuration application %@ is missing. Try editing the configuration file %@." = "Liitännäisen määrittelyohjelma %1$@ puuttuu. Yritä muokata määrittelytiedostoa %2$@.";

/* No comment provided by engineer. */
"Plug-in configuration application %@ or configuration file %@ could not be opened." = "Liitännäisen määrittelyohjelmaa %1$@ tai määrittelytiedostoa %2$@ ei voitu avata.";

/* No comment provided by engineer. */
"Plug-in configuration application: %@ is missing." = "Liitännäisen määrittelyohjelma %@ puuttuu.";

/* No comment provided by engineer. */
"Plug-in configuration file %@ is missing." = "Liitännäisen määrittelytiedosto %@ puuttuu.";

/* No comment provided by engineer. */
"Plug-in Configure Failed" = "Liitännäisen määrittely epäonnistui";

/* No comment provided by engineer. */
"Save" = "Tallenna";

/* No comment provided by engineer. */
"Save Changes?" = "Tallennetaanko muutokset?";

/* No comment provided by engineer. */
"Server not found" = "Palvelinta ei löytynyt";

/* No comment provided by engineer. */
"Some of the selected directory domains are already within your custom path." = "Jotkin valituista hakemistodomaineista ovat jo muokatussa polussa.";

/* No comment provided by engineer. */
"The entered name and password do not permit login to the remote server. One or both may not be valid, or they may have been entered incorrectly." = "Syötetty käyttäjätunnus ja salasana eivät mahdollista kirjautumista sisään etäpalvelimelle. Toinen tai molemmat saattavat olla virheellisiä tai ne on syötetty väärin.";

/* No comment provided by engineer. */
"The remote server is using a different version of Mac OS X. Remote Directory Setup requires both machines to have the same version." = "Etäpalvelin käyttää eri Mac OS X -versiota. Hakemistopalveluiden käyttöönotto edellyttää, että molemmilla tietokoneilla on sama versio.";

/* No comment provided by engineer. */
"The remote server may not be available or the URL may have been entered incorrectly." = "Etäpalvelin ei ole ehkä käytettävissä tai osoite on syötetty väärin.";

/* No comment provided by engineer. */
"This directory domain is already within your custom path." = "Tämä hakemistodomain on jo muokatussa polussa.";

/* No comment provided by engineer. */
"This field must contain only ASCII (Roman) characters." = "Tämä kenttä voi sisältää vain ASCII-merkkejä.";

/* No comment provided by engineer. */
"This plug-in does not require configuration." = "Tämä liitännäinen ei vaadi määrittelyä.";

"kVerifyingNFSMountHeader" = "Yhdistetään NFS-palvelimeen.";
"kVerifyingNFSMountBody" = "Yritetään varmistaa NFS-osoitteen kelvollisuus. Jos haluat jatkaa varmistamatta, osoita Älä varmista.";
"kVerifyingNFSMountOKBtnTitle" = "Älä varmista";
"kNFSMountNoResponseHeader" = "NFS-palvelin ei vastannut.";
"kNFSMountNoResponseBody" = "NFS-palvelin ei vastannut. Haluatko silti luoda tämän liitoksen?";
"kNFSMountNoResponseOKBtnTitle" = "Luo";
"kNFSMountGoodHeader" = "NFS-palvelin näyttää toimivan.";
"kNFSMountGoodBody" = "NFS-palvelin vastasi ja näyttää toimivan. Jatka osoittamalla OK.";
"kNFSMountGoodOKBtnTitle" = "OK";
"kUserHomeDirBadPasswordHeader" = "Salasana on virheellinen.";
"kUserHomeDirBadPasswordBody" = "Käyttäjätunnukselle syötetty salasana on virheellinen.";
"kUserHomeDirPassDoesntMatchImageHeader" = "Tunnuksen ja FileVault-kotihakemiston salasanat eivät vastaa toisiaan.";
"kUserHomeDirPassDoesntMatchImageBody" = "Muuta tämän käyttäjätunnuksen salasana Järjestelmäasetuksissa niin, että se vastaa valitun FileVault-hakemiston salasanaa.";
"kEnableRootUserMenuItem" = "Salli root-käyttäjä";
"kDisableRootUserMenuItem" = "Estä root-käyttäjä";

"kODServerType" = "Open Directory -palvelin";
"kSBServerType" = "Mac OS X Server";
"kADServerType" = "Active Directory -domain";
"kLocalODMasterDisplayName" = "Paikallinen palvelin";

"kStatusDisplayStringODUp" = "Tämä palvelin vastaa normaalisti.";
"kStatusDisplayStringODDown" = "Tämä palvelin ei vastaa.";
"kStatusDisplayStringODChecking" = "Tämä tietokone yrittää yhdistää kohteeseen %@.";
"kStatusDisplayStringODNotUsed" = "Tämä palvelin ei ole tällä hetkellä käytössä.";
"kStatusDisplayStringADUp" = "Tämä domain vastaa normaalisti.";
"kStatusDisplayStringADDown" = "Tämä domain ei vastaa.";
"kStatusDisplayStringADChecking" = "Tämä tietokone yrittää yhdistää kohteeseen %@.";
"kStatusDisplayNotInAuthSearchPolicyFormat" = "%@ Tämä palvelin ei ole todentamisen hakukäytännössä.";

"kNoDirectoryServersFoundMsg" = "Hakemistopalvelimia ei ole määritelty";

"kEditDirServerMergeAccountLabelFormat" = "”%@” alla olevalla verkkotunnuksella";

"kSingleSBSFound" = "Mac OS X Server ”%@” tarjoaa seuraavia palveluita. Haluatko asettaa tietokoneen käyttämään tarjottuja palveluita?";
"kSBSMergeAccountLabelFormat" = "Kyllä, määrittele ohjelmat";
"kSBSDontMergeAccountLabelFormat" = "Määrittele palvelut";
"kSBSDontDoAnything" = "Ei, älä määrittele ohjelmia";
"kSBSOptionsPageMsgFormat" = "Haluatko, että ohjelmat määritellään käyttämään palvelimen tarjoamia palveluita? Tämä tekee seuraavaa:\r\r%@%@%@%@%@";
"kSBSAuthPageMsgFormat" = "Syötä palvelimen ylläpitäjältä saamasi kohteen ”%@” käyttäjätunnus ja salasana.";
"kSBSAuthPageMsg2Format" = "Syötä salasana tämän tietokoneen tilille ”%@”.";
"kSBSFinalPageMsgFormatMerge" = "Ohjelmat voivat nyt käyttää palvelimen ”%@” palveluita.\r\r%@\r\rJos haluat käyttää uusia palveluita, kirjaudu ulos ja takaisin sisään.";
"kSBSFinalPageMsgLocalPassChanged" = "Tunnuksen %@ salasana tällä tietokoneella vaihdettiin vastaamaan tunnuksen %@ salasanaa palvelimella ”%@”.";
"kSBSFinalPageMsgServerPassChanged" = "Tunnuksen %@ salasana palvelimella ”%@” vaihdettiin vastaamaan tunnuksen %@ salasanaa tällä tietokoneella.";
"kSBSFinalPageMsgFormatNoMerge" = "Ohjelmat voivat nyt käyttää palvelimen ”%@” palveluita.";
"kUpgradeUserFailedTitle" = "Käyttäjätunnusten määrittely epäonnistui.";
"kUpgradeUserFailedMsgFormat" = "Tapahtui odottamaton virhe tyyppiä %d. Muutoksia ei tehty.";
"kUpgradeUserFailedbadPasswdMSg" = "Verkkotunnuksen salasana on virheellinen. Tarkista salasana ja käyttäjätunnus ja yritä uudelleen.";
"kUpgradeUserFailedDSErrorMSg" = "Tapahtui Open Directory -virhe. Muutoksia ei tehty.";
"kUpgradeUserFailedBackupErrorMSg" = "Otettaessa varmuuskopiointia käyttöön tapahtui virhe. Muutoksia ei tehty. Jos haluat jatkaa ilman varmuuskopiointia, poista varmuuskopiointi käytöstä ja yritä uudelleen.";

"kAugmentUserBindingToSBSAlert" = "Käytetäänkö palvelimen palveluita?";
"kAugmentUserBindingToSBSMsgFormat" = "Jos haluat käyttää kohteen %@ palveluita, tilin asetukset määritellään käyttämään kyseisiä palveluita.";
"kAugmentUserBindingToSBSBindBtn" = "Käytä palvelinta";
"kAugmentUserBindingToSBSDontBindBtn" = "Kumoa";

"kSureToDeleteODServerTitle" = "Lopetetaanko hakemistopalvelimen käyttö?";
"kSureToDeleteODServerMsg" = "Haluatko varmasti lopettaa hakemistopalvelimen %@ käyttämisen? Toimintoa ei voida perua.";
"kSureToDeleteSBServerTitle" = "Lopetetaanko Mac OS X Serverin käyttö?";
"kSureToDeleteSBServerMsg" = "Haluatko varmasti lopettaa Mac OS X Serverin %@ palveluiden käyttämisen? Toimintoa ei voida perua.";
"kCantDeleteLocalSBSTitle" = "Paikallista palvelinta ei voida poistaa.";
"kCantDeleteLocalSBSMsg" = "Paikallinen palvelin tarvitaan, jotta tämä Mac OS X Server toimii oikein, eikä sitä voida poistaa.";
"kCantEditLocalSBSTitle" = "Paikallista palvelinta ei voida muokata.";
"kCantEditLocalSBSMsg" = "Paikallinen palvelin tarvitaan, jotta tämä Mac OS X Server toimii oikein, eikä sitä voida muokata.";
"kDeleteServerBtn" = "Lopeta palvelimen käyttö";
"kDontDeleteServerBtn" = "Kumoa";
"kLeaveServerBtn" = "Lopeta palvelimen käyttö";
"kDontLeaveServerBtn" = "Kumoa";
"kLogOutBtn" = "Kirjaudu ulos";
"kQuitBtn" = "Lopeta";
"kSkipFoundSBSSheetBtn" = "Ohita";
"kJoinButton" = "Viimeistele käyttöönotto";
"kBeginSetupBtn" = "Aloita käyttöönotto";
"kNewSBSStepTitleAlert" = "Johdanto";
"kNewSBSStepTitleAuth" = "Todentaminen";
"kNewSBSStepTitleOptions" = "Määrittelyvalinnat";
"kNewSBSStepTitleBackUp" = "Varmuuskopioi";
"kNewSBSStepTitleFinished" = "Suoritettu";
"kNewSBSBadLocalPassword" = "Todentaminen epäonnistui.";
"kNewSBSBadLocalPasswordMsg" = "Paikalliselle käyttäjätunnukselle syötetty salasana on virheellinen.";
"kNewSBSBadNetPassword" = "Todentaminen epäonnistui.";
"kNewSBSBadNetPasswordMsg" = "Palvelimella olevalle tunnukselle syötetty käyttäjätunnus ja salasana eivät täsmää.";
"kSureNotToMergeTitle" = "Haluatko varmasti jatkaa päivittämättä paikallista tunnusta?";
"kSureNotToMergeMsg" = "Jos et päivitä, sinun on kirjauduttava sisään palvelimen ylläpitäjältä saamallasi käyttäjätunnuksella ja salasanalla, jotta voit käyttää palvelimen ”%@” palveluita.";
"kDontMergeBtn" = "Älä päivitä";
"kGoBackBtn" = "Takaisin";
"kMailServiceName" = "Mail";
"kMailServiceDescription" = "Luo sähköpostitunnuksen ja näyttää palvelimella olevat yhteystiedot.";
"kChatServiceName" = "iChat";
"kChatServiceDescription" = "Luo iChat-tunnuksen ja täyttää iChat-ystäväluettelon.";
"kBackupServiceName" = "Time Machine";
"kBackupServiceDescription" = "Mahdollistaa tietojen varmuuskopioimisen tältä tietokoneelta tälle palvelimelle.";
"kFileServicesServiceName" = "Tiedostonjako";
"kFileServicesServiceDescription" = "Lisää jaettuja levyjä Finderin sivupalkkiin.";
"kCalendarServiceName" = "iCal";
"kCalendarServiceDescription" = "Luo henkilökohtaisen kalenterin palvelimelle ja lisää sen iCaliin.";
"kWebServiceName" = "Verkko";
"kWebServiceDescription" = "Tarjoaa pääsyn ryhmän verkkosivustolle, jossa on wiki ja blogi.";
"kVPNServiceName" = "VPN";
"kVPNServiceDescription" = "Mahdollistaa yhdistämisen yksityiseen verkkoon etäsijainneista.";
"kMailConfigDetails" = "• Määrittelee Mailin käyttämään palvelimella olevaa sähköpostitunnusta\r";
"kIChatConfigDetails" = "• Määrittelee iChatin käyttämään palvelimella olevaa iChat-tunnusta\r";
"kFileSharingConfigDetails" = "• Lisää jaettuja levyjä palvelimelta Finderin sivupalkkiin\r";
"kICalConfigDetails" = "• Lisää henkilökohtaisen kalenterin palvelimelta iCaliin\r";
"kVPNConfigDetails" = "• Lisää VPN-määrittelyn tätä palvelinta varten\r";
"kDontAskAboutThisServerAgain" = "Älä kysy enää tästä palvelimesta";
"kDontAskAboutTheseServersAgain" = "Älä kysy enää näistä palvelimista";

"kBackupAllData" = "Varmuuskopioi kaikki tietokoneen tiedot";
"kCouldntAddServer" = "Palvelinta ei voida lisätä.";
"kCouldntAddServerUnexpectedErrorFormat" = "Tapahtui odottamaton virhe tyyppiä %d (%@).";
"kBadODServerNameFormat" = "Palvelin %@ ei vastannut. Tarkista, että syötetty osoite on oikein.";
"kDuplicateServerNameFormat" = "Tietokone käyttää jo palvelinta %@ tai vastaavaa kopiota.";
"kServerDoesntSupportSSLFormat" = "%@ ei tue SSL:llä salattuja hakemistoyhteyksiä.";
"kServerHasUnsupportedMappingsFormat" = "Kohdetta %@ ei voida lisätä, koska se ei ole Open Directory -palvelin tai se käyttää muokattuja kuvauksia.\n\nJos haluat lisätä tämän palvelimen:\n\n• Osoita pääikkunassa Näytä lisävalinnat -painiketta\n• Valitse työkalupalkista Palvelut\n• Lisää palvelin sopivilla kuvauksilla käyttämällä LDAPv3-palvelua";
"kCouldntAddADDomain" = "Domainia ei voida lisätä.";
"kCouldntAddADDomainUnexpectedErrorFormat" = "Tapahtui odottamaton virhe tyyppiä %d (%@).";
"kBadADDomainNameFormat" = "Palvelin %@ ei vastannut. Tarkista, että syötetty osoite on oikein.";
"kPasswordsDontMatchTitle" = "Syötetyt salasanat eivät vastaa toisiaan.";
"kPasswordsDontMatchMsg" = "Yritä uudelleen.";

"kAddODServerStepCheckingAddress" = "Vahvistetaan palvelimen osoitetta…";
"kAddODServerStepCheckingForDupes" = "Etsitään vastaavia palvelimia…";
"kAddODServerStep1" = "Palvelintietojen etsintä…";
"kAddODServerStep2" = "Varmennetaan kuvausta…";
"kAddODServerStep3" = "Tunnistetaan vaadittuja turvallisuustasoja ja sidosvaatimuksia…";
"kAddODServerStep4" = "Yritetään sitoa…";
"kAddODServerStep5" = "Lisätään palvelinta määrittelyyn…";

"kCouldntBindToWGSWithADParent" = "Ei voida sitoa.";
"kCouldntBindToWGSWithADParentMsg" = "Palvelin %@ on sidottu Active Directory -domainiin %@. Jos haluat sitoa tähän palvelimeen, sinun on ensin sidottava Active Directory -domainiin.";
"kDupeComputerRecordFound" = "Hakemistossa on jo tämänniminen tietokonetietue. Voit korvata tietueen, mutta tietueen korvaaminen saattaa estää toisen tietokoneen käytön, jos tietue on käytössä.";
"kAuthedBindingRequired" = "Tämä palvelin vaatii todennetun sidonnan. Syötä käyttäjätunnus ja salasana palvelimelle.";
"kAuthedBindingAllowed" = "Tämä palvelin sallii todennetun sidonnan. Voit syöttää käyttäjätunnuksen ja salasanan. Voit myös sitoa anonyymisti jättämällä ne tyhjiksi.";
"kAuthedBindingAuthFailure" = "Syötetty käyttäjätunnus ja salasana eivät täsmää. Tarkista todentamistiedot ja yritä uudelleen.";
"kPermissionFailureDuringAuthBind" = "Sinulla ei ole oikeutta korvata olemassa olevaa tietokonetietuetta. Ilmoita tästä järjestelmän ylläpitäjälle tai yritä toista tietokonetunnusta.";

/* toolbar labels */
"kUsers" = "Käyttäjät";
"kServices" = "Palvelut";
"kAuth" = "Todentaminen";
"kAdvanced" = "Lisävalinnat";
"kDebug" = "Vianmääritys";
"kSearchPaths" = "Hakukäytäntö";
